cmsis-svd/cmsis-svd/data/NXP/LPC11E6x.svd
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>CTCR</name>																	
		<description>Count Control Register. The CTCR selects between Timer and Counter mode, and in Counter mode selects the signal and edge(s) for counting.</description>																	
		<addressOffset>0x070</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>CTM</name>															
				<description>Counter/Timer Mode. This field selects which rising PCLK edges can increment Timer's Prescale Counter (PC), or clear PC and increment Timer Counter (TC). If Counter mode is selected in the CTCR, bits 2:0 in the Capture Control Register (CCR) must be programmed as 000.</description>															
				<bitRange>[1:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>TIMER_MODE</name>													
						<description>Timer Mode.  Increments every rising PCLK edge</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RISING</name>													
						<description>Counter Moderising edge. . TC is incremented on rising edges on the CAP input selected by bits 3:2.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>FALLING</name>													
						<description>Counter Mode falling edge: TC is incremented on falling edges on the CAP input selected by bits 3:2.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DUAL</name>													
						<description>Counter Mode dual edge: TC is incremented on both edges on the CAP input selected by bits 3:2.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>CIS</name>															
				<description>Count Input Select. In counter mode (when bits 1:0 in this register are not 00), these bits select which CAP pin is sampled for clocking. Value 0x3 isreserved.</description>															
				<bitRange>[3:2]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>CAPTURE_CHANNEL_0</name>													
						<description>Capture channel 0.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CAPTURE_CHANNEL_1</name>													
						<description>Capture channel 1.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CAPTURE_CHANNEL_2</name>													
						<description>Capture channel 2.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>ENCC</name>															
				<description>Setting this bit to 1 enables clearing of the timer and the prescaler when the capture-edge event specified in bits 7:5 occurs.</description>															
				<bitRange>[4:4]</bitRange>															
														
			</field>																
			<field>																
				<name>SELCC</name>															
				<description>Edge select. When bit 4 is 1, these bits select which capture input edge will cause the timer and prescaler to be cleared. These bits have no effect when bit 4 is low. Values 0x2 to 0x3 and 0x6 to 0x7 are reserved.</description>															
				<bitRange>[7:5]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>CAP0RISING</name>													
						<description>Rising Edge of thesignal on capture channel 0 clears the timer (if bit 4 is set).</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CAP0FALLING</name>													
						<description>Falling Edge of thesignal on capture channel 0 clears the timer (if bit 4 is set).</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CAP1RISING</name>													
						<description>Rising Edge of thesignal on capture channel 1 clears the timer (if bit 4 is set).</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CAP1FALLING</name>													
						<description>Falling Edge of thesignal on capture channel 1 clears the timer (if bit 4 is set).</description>													
						<value>0x3</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CAP2RISING</name>													
						<description>Rising Edge of thesignal on capture channel 2 clears the timer (if bit 4 is set).</description>													
						<value>0x4</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CAP1FALLING</name>													
						<description>Falling Edge of thesignal on capture channel 2 clears the timer (if bit 4 is set).</description>													
						<value>0x5</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>															
				<bitRange>[31:8]</bitRange>															
														
