cmsis-svd/cmsis-svd/data/NXP/LPC11E6x.svd
			</field>																	
		</fields>																		
	</register>																			
	<register>																			
		<dim>4</dim>																		
		<dimIncrement>0x4</dimIncrement>																		
		<dimIndex>0-3</dimIndex>																		
		<name>MR%s</name>																		
		<description>Match Register. MR can be enabled through the MCR to reset the TC, stop both the TC and PC, and/or generate an interrupt every time MR0 matches the TC.</description>																		
		<addressOffset>0x018</addressOffset>																		
		<access>read-write</access>																		
		<resetValue>0</resetValue>																		
		<resetMask>0xFFFFFFFF</resetMask>																		
		<fields>																		
			<field>																	
				<name>MATCH</name>																
				<description>Timer counter match value.</description>																
				<bitRange>[31:0]</bitRange>																
			</field>																	
		</fields>																		
	</register>																			
	<register>																			
		<name>CCR</name>																		
		<description>Capture Control Register. The CCR controls which edges of the capture inputs are used to load the Capture Registers and whether or not an interrupt is generated when a capture takes place.</description>																		
		<addressOffset>0x028</addressOffset>																		
		<access>read-write</access>																		
		<resetValue>0</resetValue>																		
		<resetMask>0xFFFFFFFF</resetMask>																		
		<fields>																		
			<field>																	
				<name>CAP0RE</name>																
				<description>Rising edge of capture channel 0:  a sequence of 0 then 1 causes CR0 to be loaded with the contents of TC.</description>																
				<bitRange>[0:0]</bitRange>																
				<enumeratedValues>																
				<name>ENUM</name>																
					<enumeratedValue>															
						<name>ENABLED</name>														
						<description>Enabled.</description>														
						<value>1</value>														
					</enumeratedValue>															
					<enumeratedValue>															
						<name>DISABLED</name>														
						<description>Disabled.</description>														
						<value>0</value>														
					</enumeratedValue>															
				</enumeratedValues>																
			</field>																	
			<field>																	
				<name>CAP0FE</name>																
				<description>Falling edge of capture channel 0:: a sequence of 1 then 0 causes CR0 to be loaded with the contents of TC.</description>																
				<bitRange>[1:1]</bitRange>																
				<enumeratedValues>																
				<name>ENUM</name>																
					<enumeratedValue>															
						<name>ENABLED</name>														
						<description>Enabled.</description>														
						<value>1</value>														
					</enumeratedValue>															
					<enumeratedValue>															
						<name>DISABLED</name>														
						<description>Disabled.</description>														
						<value>0</value>														
					</enumeratedValue>															
				</enumeratedValues>																
			</field>																	
			<field>																	
				<name>CAP0I</name>																
				<description>Generate interrupt on channel 0 capture event: a CR0 load  generates an interrupt.</description>																
				<bitRange>[2:2]</bitRange>																
				<enumeratedValues>																
				<name>ENUM</name>																
					<enumeratedValue>															
						<name>ENABLED</name>														
						<description>Enabled.</description>														
						<value>1</value>														
					</enumeratedValue>															
					<enumeratedValue>															
						<name>DISABLED</name>														
						<description>Disabled.</description>														
						<value>0</value>														
					</enumeratedValue>															
				</enumeratedValues>																
			</field>																	
			<field>																	
				<name>CAP1RE</name>																
				<description>Rising edge of capture channel 1:  a sequence of 0 then 1 causes CR1 to be loaded with the contents of TC.</description>																
				<bitRange>[3:3]</bitRange>																
				<enumeratedValues>																
				<name>ENUM</name>																
					<enumeratedValue>															
						<name>ENABLED</name>														
						<description>Enabled.</description>														
						<value>1</value>														
					</enumeratedValue>															
					<enumeratedValue>															
						<name>DISABLED</name>														
						<description>Disabled.</description>														
						<value>0</value>														
					</enumeratedValue>															
				</enumeratedValues>																
			</field>																	
			<field>																	
				<name>CAP1FE</name>																
				<description>Falling edge of capture channel 1:: a sequence of 1 then 0 causes CR1 to be loaded with the contents of TC.</description>																
				<bitRange>[4:4]</bitRange>																
				<enumeratedValues>																
				<name>ENUM</name>																
					<enumeratedValue>															
						<name>ENABLED</name>														
						<description>Enabled.</description>														
						<value>1</value>														
					</enumeratedValue>															
					<enumeratedValue>															
						<name>DISABLED</name>														
						<description>Disabled.</description>														
						<value>0</value>														
					</enumeratedValue>															
				</enumeratedValues>																
			</field>																	
			<field>																	
				<name>CAP1I</name>																
				<description>Generate interrupt on channel 1 capture event: a CR1 load  generates an interrupt.</description>																
				<bitRange>[5:5]</bitRange>																
				<enumeratedValues>																
				<name>ENUM</name>																
					<enumeratedValue>															
						<name>ENABLED</name>														
						<description>Enabled.</description>														
						<value>1</value>														
					</enumeratedValue>															
					<enumeratedValue>															
						<name>DISABLED</name>														
						<description>Disabled.</description>														
						<value>0</value>														
					</enumeratedValue>															
				</enumeratedValues>																
			</field>																	
			<field>																	
				<name>CAP2RE</name>																
				<description>Rising edge of capture channel 2:  a sequence of 0 then 1 causes CR2 to be loaded with the contents of TC.</description>																
				<bitRange>[6:6]</bitRange>																
				<enumeratedValues>																
				<name>ENUM</name>																
					<enumeratedValue>															
						<name>ENABLED</name>														
						<description>Enabled.</description>														
						<value>1</value>														
					</enumeratedValue>															
					<enumeratedValue>															
						<name>DISABLED</name>														
						<description>Disabled.</description>														
						<value>0</value>														
					</enumeratedValue>															
				</enumeratedValues>																
			</field>																	
			<field>																	
				<name>CAP2FE</name>																
				<description>Falling edge of capture channel 2: a sequence of 1 then 0 causes CR2 to be loaded with the contents of TC.</description>																
				<bitRange>[7:7]</bitRange>																
				<enumeratedValues>																
				<name>ENUM</name>																
					<enumeratedValue>															
						<name>ENABLED</name>														
						<description>Enabled.</description>														
						<value>1</value>														
					</enumeratedValue>															
					<enumeratedValue>															
						<name>DISABLED</name>														
						<description>Disabled.</description>														
						<value>0</value>														
					</enumeratedValue>															
				</enumeratedValues>																
			</field>																	
			<field>																	
				<name>CAP2I</name>																
				<description>Generate interrupt on channel 2 capture event: a CR2 load  generates an interrupt.</description>																
				<bitRange>[8:8]</bitRange>																
				<enumeratedValues>																
				<name>ENUM</name>																
					<enumeratedValue>															
						<name>ENABLED</name>														
						<description>Enabled.</description>														
						<value>1</value>														
					</enumeratedValue>															
					<enumeratedValue>															
						<name>DISABLED</name>														
						<description>Disabled.</description>														
						<value>0</value>														
					</enumeratedValue>															
				</enumeratedValues>																
			</field>																	
			<field>																	
				<name>RESERVED</name>																
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>																
				<bitRange>[31:9]</bitRange>																
															
