cmsis-svd/cmsis-svd/data/NXP/LPC11E6x.svd
			</field>																	
		</fields>																		
	</register>																			
	<register>																			
		<name>PWMC</name>																		
		<description>PWM Control Register. The PWMCON enables PWM mode for the external match pins CT32Bn_MAT[3:0].</description>																		
		<addressOffset>0x074</addressOffset>																		
		<access>read-write</access>																		
		<resetValue>0</resetValue>																		
		<resetMask>0xFFFFFFFF</resetMask>																		
		<fields>																		
			<field>																	
				<name>PWMEN0</name>																
				<description>PWM mode enable for channel0.</description>																
				<bitRange>[0:0]</bitRange>																
				<enumeratedValues>																
				<name>ENUM</name>																
					<enumeratedValue>															
						<name>EM0</name>														
						<description>CT32Bn_MAT0 is controlled by EM0.</description>														
						<value>0</value>														
					</enumeratedValue>															
					<enumeratedValue>															
						<name>PWM</name>														
						<description>PWM mode is enabled for CT32Bn_MAT0.</description>														
						<value>1</value>														
					</enumeratedValue>															
				</enumeratedValues>																
			</field>																	
			<field>																	
				<name>PWMEN1</name>																
				<description>PWM mode enable for channel1.</description>																
				<bitRange>[1:1]</bitRange>																
				<enumeratedValues>																
				<name>ENUM</name>																
					<enumeratedValue>															
						<name>EM1</name>														
						<description>CT32Bn_MAT01 is controlled by EM1.</description>														
						<value>0</value>														
					</enumeratedValue>															
					<enumeratedValue>															
						<name>PWM</name>														
						<description>PWM mode is enabled for CT32Bn_MAT1.</description>														
						<value>1</value>														
					</enumeratedValue>															
				</enumeratedValues>																
			</field>																	
			<field>																	
				<name>PWMEN2</name>																
				<description>PWM mode enable for channel2.</description>																
				<bitRange>[2:2]</bitRange>																
				<enumeratedValues>																
				<name>ENUM</name>																
					<enumeratedValue>															
						<name>EM2</name>														
						<description>CT32Bn_MAT2 is controlled by EM2.</description>														
						<value>0</value>														
					</enumeratedValue>															
					<enumeratedValue>															
						<name>PWM</name>														
						<description>PWM mode is enabled for CT32Bn_MAT2.</description>														
						<value>1</value>														
					</enumeratedValue>															
				</enumeratedValues>																
			</field>																	
			<field>																	
				<name>PWMEN3</name>																
				<description>PWM mode enable for channel3. Note: It is recommended to use match channel 3 to set the PWM cycle.</description>																
				<bitRange>[3:3]</bitRange>																
				<enumeratedValues>																
				<name>ENUM</name>																
					<enumeratedValue>															
						<name>EM3</name>														
						<description>CT32Bn_MAT3 is controlled by EM3.</description>														
						<value>0</value>														
					</enumeratedValue>															
					<enumeratedValue>															
						<name>PWM</name>														
						<description>PWM mode is enabled for CT132Bn_MAT3.</description>														
						<value>1</value>														
					</enumeratedValue>															
				</enumeratedValues>																
			</field>																	
			<field>																	
				<name>RESERVED</name>																
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>																
				<bitRange>[31:4]</bitRange>																
															
			</field>																	
		</fields>																		
	</register>																			
</registers>																				
																							

		</peripheral>
		
		<peripheral derivedFrom="CT32B0">
			<name>CT32B1</name>
			<description>32-bit counter/timers CT32B1</description>
			<baseAddress>0x40018000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>CT32B1</name>
				<value>19</value>
			</interrupt>
			
		</peripheral>
		<peripheral>
	<name>ADC</name>
	<description>12-bit Analog-to-Digital Converter (ADC)</description>
	<groupName>ADC</groupName>
	<baseAddress>0x4001C000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>ADC_A</name>
	<value>24</value>
	</interrupt>
	<registers>
		<register>
			<name>CTRL</name>
			<description>A/D Control Register. Contains the clock divide value, enable bits for each sequence and the A/D power-down bit.</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CLKDIV</name>
					<description>The system clock is divided by this value plus one to produce the clock for the A/D converter, which should be less than or equal to 50 MHz (up to 100 MHz in 10-bit mode).  Typically, software should program the smallest value in this field that yields this maximum clock rate or slightly less, but in certain cases (such as a high-impedance analog source) a slower clock may be desirable.</description>
					<bitRange>[7:0]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[9:8]</bitRange>

