cmsis-svd/cmsis-svd/data/NXP/LPC11E6x.svd
						</field>
					</fields>
				</register>
				<register>
					<name>MATCH</name>
					<description>RTC match register</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0xFFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MATVAL</name>
							<description>Contains the match value against which the 1 Hz RTC timer will be compared to generate set the alarm flag RTC_ALARM and generate an alarm interrupt/wake-up if enabled.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>COUNT</name>
					<description>RTC counter register</description>
					<addressOffset>0x008</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VAL</name>
							<description>A read reflects the current value of the main, 1 Hz RTC timer. A write loads a new initial value into the timer.  The RTC counter will count up continuously at a 1 Hz rate once the RTC Software Reset is removed (by clearing bit 0 of the CTRL register). Only write to this register when the RTC1HZ_EN bit in the RTC CTRL Register is 0. The counter increments one second after the RTC1HZ_EN bit is set.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKE</name>
					<description>RTC high-resolution/wake-up timer control register</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VAL</name>
							<description>A read reflects the current value of the high-resolution/wake-up timer. A write pre-loads a start count value into the wake-up timer and initializes a count-down sequence.   Do not write to this register while counting is in progress.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>	
		
		<peripheral>
			<name>DMATRIGMUX</name>
			<description>DMA controller</description>
			<groupName>DMATRIGMUX</groupName>
			<baseAddress>0x40028000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			
			<registers>
				<register>
					<dim>16</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-15</dimIndex>
					<name>DMA_ITRIG_PINMUX[%s]</name>
					<displayName>DMA_ITRIG_PINMUX[%s]</displayName>
					<description>Trigger input select register for DMA channel 0.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x1F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INP_N</name>
							<description>Trigger input number (decimal value) to DMA channel n. All other values are reserved.  0	 = ADC0_SEQA_IRQ 1 = 	ADC0_SEQB_IRQ 2	 = CT16B0_MAT0 3 = 	CT16B1_MAT0 4	 = CT32B0_MAT0 5	 = CT16B1_MAT0 6	 = PINT0 ( pin interrupt 0) 7 = 	PINT1 (pin interrupt1 ) 8 = 	SCT0_DMA0 9 = 	SCT0_DMA1 10	 = SCT1_DMA0 11	 = SCT1_DMA1</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		
		
		
		<peripheral>
			<name>PMU</name>
			<description>Power Management Unit (PMU)</description>
			<groupName>PMU</groupName>
			<baseAddress>0x40038000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>PCON</name>
					<description>Power control register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PM</name>
							<description>Power mode</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DEFAULT</name>
									<description>Default. The part is in active or sleep mode.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DEEP_SLEEP</name>
									<description>Deep-sleep. ARM WFI will enter Deep-sleep mode.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POWER_DOWN</name>
									<description>Power-down. ARM WFI will enter Power-down mode.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DEEP_POWER_DOWN</name>
									<description>Deep power-down. ARM WFI will enter Deep-power down mode (ARM Cortex-M0+ core powered-down).</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NODPD</name>
							<description>A 1 in this bit prevents entry to Deep power-down mode when 0x3 is written to the PM field above, the SLEEPDEEP bit is set, and a WFI is executed.   This bit is cleared only by power-on reset, so writing a one to this bit locks the part in a mode in which Deep power-down mode is blocked.</description>
							<bitRange>[3:3]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not write ones to this bit.</description>
							<bitRange>[7:4]</bitRange>

						</field>
						<field>
							<name>SLEEPFLAG</name>
							<description>Sleep mode flag</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ACTIVE_MODE</name>
									<description>Active mode. Read: No power-down mode entered. Part is in Active mode. Write: No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOW_POWER_MODE</name>
									<description>Low power mode. Read: Sleep/Deep-sleep or Deep power-down mode entered. Write: Writing a 1 clears the SLEEPFLAG bit to 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not write ones to this bit.</description>
							<bitRange>[10:9]</bitRange>

