cmsis-svd/cmsis-svd/data/NXP/LPC11E6x.svd
						</field>
						<field>
							<name>DPDFLAG</name>
							<description>Deep power-down flag</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOT_DEEP_POWER_DOWN</name>
									<description>Not Deep power-down. Read: Deep power-down mode not entered. Write: No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DEEP_POWER_DOWN</name>
									<description>Deep power-down. Read: Deep power-down mode entered. Write: Clear the Deep power-down flag.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not write ones to this bit.</description>
							<bitRange>[31:12]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>GPREG%s</name>
					<description>General purpose register 0</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>GPDATA</name>
							<description>Data retained during Deep power-down mode.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>GPREG4</name>
					<description>Deep power down control register</description>
					<addressOffset>0x014</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not write ones to this bit.</description>
							<bitRange>[9:0]</bitRange>

						</field>
						<field>
							<name>WAKEUPHYS</name>
							<description>WAKEUP pin hysteresis enable</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_HYSTERESIS_F</name>
									<description>Disable Hysteresis for WAKUP pin disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable. Hysteresis for WAKEUP pin enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAKEPAD_DISABLE</name>
							<description>WAKEUP pin disable. Setting this bit disables the wake-up pin, so it can be used for other purposes. Never set this bit if you intend to use a pin to wake up the part from Deep power-down mode. You can only disable the wake-up pin if the RTC wake-up timer is enabled and configured. Setting this bit is not necessary if Deep power-down mode is not used.</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable. The wake-up function is enabled on pin PIO0_16.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable. Setting this bit disables the wake-up function on pin PIO0_16.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPDATA</name>
							<description>Data retained during Deep power-down mode.</description>
							<bitRange>[31:12]</bitRange>

						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		
		
		
		
		<peripheral>
			<name>FLASHCTRL</name>
			<description> Flash controller </description>
			<groupName>FLASHCTRL</groupName>
			<baseAddress>0x4003C000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>FLASH</name>
				<value>27</value>
			</interrupt>
			<registers>												
				<register>											
					<name>FLASHCFG</name>										
					<description>Flash configuration register</description>										
					<addressOffset>0x010</addressOffset>										
					<access>read-write</access>										
					<resetValue>0</resetValue>										
					<resetMask>0x00000000</resetMask>										
					<fields>										
						<field>									
							<name>FLASHTIM</name>								
							<description>Flash memory access time. FLASHTIM +1 is equal to the number of system clocks used for flash access.</description>								
							<bitRange>[1:0]</bitRange>								
							<enumeratedValues>								
								<name>ENUM</name>								
								<enumeratedValue>							
									<name>1_SYSTEM_CLOCK_FLASH</name>						
									<description>1 system clock flash access time (for system clock frequencies of up to 20 MHz).</description>						
									<value>0x0</value>						
								</enumeratedValue>							
								<enumeratedValue>							
									<name>2_SYSTEM_CLOCKS_FLAS</name>						
									<description>2 system clocks flash access time (for system clock frequencies of up to 30 MHz).</description>						
									<value>0x1</value>						
								</enumeratedValue>							
								<enumeratedValue>							
									<name>RESERVED_</name>						
									<description>Reserved.</description>						
									<value>0x2</value>						
								</enumeratedValue>							
								<enumeratedValue>							
									<name>RESERVED_</name>						
									<description>Reserved.</description>						
									<value>0x3</value>						
								</enumeratedValue>							
							</enumeratedValues>								
						</field>									
						<field>									
							<name>RESERVED</name>								
							<description>Reserved. User software must not change the value of these bits. Bits 31:2 must be written back exactly as read.</description>								
							<bitRange>[31:2]</bitRange>								
														
