cmsis-svd/cmsis-svd/data/NXP/LPC11E6x.svd
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>SYSPLLCLKSEL</name>																	
		<description>System PLL clock source select</description>																	
		<addressOffset>0x040</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>SEL</name>															
				<description>System PLL clock source</description>															
				<bitRange>[1:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>IRC</name>													
						<description>IRC</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>SYSTEM_OSCILLATOR</name>													
						<description>System oscillator. Crystal Oscillator (SYSOSC)</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>32_KHZ_CLOCK</name>													
						<description>32 kHz clock.Select this option when the 32 kHz clock is the clock source for the main clock and select the pll input in the MAINCLKSEL register. Do not use the 32 kHz clock with the PLL.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:2]</bitRange>															
														
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>SYSPLLCLKUEN</name>																	
		<description>System PLL clock source update enable</description>																	
		<addressOffset>0x044</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0x1</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>ENA</name>															
				<description>Enable system PLL clock source update</description>															
				<bitRange>[0:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>NO_CHANGE</name>													
						<description>No change</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>UPDATE_CLOCK_SOURCE</name>													
						<description>Update clock source</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:1]</bitRange>															
														
			</field>																
		</fields>																	
	</register>																		
																			
																			
	<register>																		
		<name>MAINCLKSEL</name>																	
		<description>Main clock source select</description>																	
		<addressOffset>0x070</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>SEL</name>															
				<description>Clock source for main clock</description>															
				<bitRange>[1:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>IRC_OSCILLATOR</name>													
						<description>IRC Oscillator</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PLL_INPUT</name>													
						<description>PLL input</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>WATCHDOG_OSCILLATOR</name>													
						<description>Watchdog oscillator</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PLL_OUTPUT</name>													
						<description>PLL output</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:2]</bitRange>															
														
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>MAINCLKUEN</name>																	
		<description>Main clock source update enable</description>																	
		<addressOffset>0x074</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0x1</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>ENA</name>															
				<description>Enable main clock source update</description>															
				<bitRange>[0:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>NO_CHANGE</name>													
						<description>No change</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>UPDATE_CLOCK_SOURCE</name>													
						<description>Update clock source</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:1]</bitRange>															
														
