cmsis-svd/cmsis-svd/data/NXP/LPC11E6x.svd
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>SYSTCKCAL</name>																	
		<description>System tick counter calibration</description>																	
		<addressOffset>0x154</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0x00000000</resetMask>																	
		<fields>																	
			<field>																
				<name>CAL</name>															
				<description>System tick timer calibration value</description>															
				<bitRange>[25:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:26]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>IRQLATENCY</name>																	
		<description>IRQ delay. Allows trade-off between interrupt latency and determinism.</description>																	
		<addressOffset>0x170</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0x00000010</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>LATENCY</name>															
				<description>8-bit latency value</description>															
				<bitRange>[7:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:8]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>NMISRC</name>																	
		<description>NMI Source Control</description>																	
		<addressOffset>0x174</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>IRQN</name>															
				<description>The IRQ number of the interrupt that acts as the Non-Maskable Interrupt (NMI) if bit 31 is 1. See Table 6 for the list of interrupt sources and their IRQ numbers.</description>															
				<bitRange>[4:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[30:5]</bitRange>															
			</field>																
			<field>																
				<name>NMIEN</name>															
				<description>Write a 1 to this bit to enable the Non-Maskable Interrupt (NMI) source selected by bits 4:0.</description>															
				<bitRange>[31:31]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<dim>8</dim>																	
		<dimIncrement>0x4</dimIncrement>																	
		<dimIndex>0-7</dimIndex>																	
		<name>PINTSEL%s</name>																	
		<description>GPIO Pin Interrupt Select register 0</description>																	
		<addressOffset>0x178</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>INTPIN</name>															
				<description>Pin number. PIO0_0 = 0, ..., PIO0_23 = 23, PIO1_0 = 24, ..., PIO1_31 = 55, PIO2_0 = 56, ..., PIO2_7 = 63.</description>															
				<bitRange>[5:0]</bitRange>															
														
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:6]</bitRange>															
																		
																		
			</field>																
		</fields>																	
	</register>																		
																			
																			
	<register>																		
		<name>STARTERP0</name>																	
		<description>Start logic 0 interrupt wake-up enable register 0</description>																	
		<addressOffset>0x204</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>PINT0</name>															
				<description>Pin interrupt 0 wake-up</description>															
				<bitRange>[0:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLED</name>													
						<description>Enabled</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>PINT1</name>															
				<description>Pin interrupt 1 wake-up</description>															
				<bitRange>[1:1]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLED</name>													
						<description>Enabled</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>PINT2</name>															
				<description>Pin interrupt 2 wake-up</description>															
				<bitRange>[2:2]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLED</name>													
						<description>Enabled</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>PINT3</name>															
				<description>Pin interrupt 3 wake-up</description>															
				<bitRange>[3:3]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLED</name>													
						<description>Enabled</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>PINT4</name>															
				<description>Pin interrupt 4 wake-up</description>															
				<bitRange>[4:4]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLED</name>													
						<description>Enabled</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>PINT5</name>															
				<description>Pin interrupt 5 wake-up</description>															
				<bitRange>[5:5]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLED</name>													
						<description>Enabled</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>PINT6</name>															
				<description>Pin interrupt 6 wake-up</description>															
				<bitRange>[6:6]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLED</name>													
						<description>Enabled</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>PINT7</name>															
				<description>Pin interrupt 7 wake-up</description>															
				<bitRange>[7:7]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLED</name>													
						<description>Enabled</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:8]</bitRange>															
														
