cmsis-svd/cmsis-svd/data/NXP/LPC11E6x.svd
			</field>									
			<field>									
				<name>CTSEN</name>								
				<description>CTS Enable. Determines whether CTS is used for flow control. CTS can be from the input pin, or from the USART's own RTS if loopback mode is enabled. See Section 11.8.4 for more information.</description>								
				<bitRange>[9:9]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>NO_FLOW_CONTROL</name>						
						<description>No flow control. The transmitter does not receive any automatic flow control signal.</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>FLOW_CONTROL_ENABLED</name>						
						<description>Flow control enabled. The transmitter uses  the CTS input (or RTS output in loopback mode) for flow control purposes.</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved. Read value is undefined, only zero should be written.</description>								
				<bitRange>[10:10]</bitRange>								
							
			</field>									
			<field>									
				<name>SYNCEN</name>								
				<description>Selects synchronous or asynchronous operation.</description>								
				<bitRange>[11:11]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>ASYNCHRONOUS</name>						
						<description>Asynchronous mode is selected.</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>SYNCHRONOUS</name>						
						<description>Synchronous mode is selected.</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>CLKPOL</name>								
				<description>Selects the clock polarity and sampling edge of received data in synchronous mode.</description>								
				<bitRange>[12:12]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>FALLING_EDGE</name>						
						<description>Falling edge. Un_RXD is sampled on the falling edge of SCLK.</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>RISING_EDGE</name>						
						<description>Rising edge. Un_RXD is sampled on the rising edge of SCLK.</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved. Read value is undefined, only zero should be written.</description>								
				<bitRange>[13:13]</bitRange>								
							
			</field>									
			<field>									
				<name>SYNCMST</name>								
				<description>Synchronous mode Master select.</description>								
				<bitRange>[14:14]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>SLAVE</name>						
						<description>Slave. When synchronous mode is enabled, the USART is a slave.</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>MASTER</name>						
						<description>Master. When synchronous mode is enabled, the USART is a master.</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>LOOP</name>								
				<description>Selects data loopback mode.</description>								
				<bitRange>[15:15]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>NORMAL_OPERATION</name>						
						<description>Normal operation.</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>LOOPBACK_MODE</name>						
						<description>Loopback mode. This provides a mechanism to perform diagnostic loopback testing for USART data. Serial data from the transmitter (Un_TXD) is connected internally to serial input of the receive (Un_RXD). Un_TXD and Un_RTS activity will also appear on external pins if these functions are configured to appear on device pins. The receiver RTS signal is also looped back to CTS and performs flow control if enabled by CTSEN.</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved. Read value is undefined, only zero should be written.</description>								
				<bitRange>[17:16]</bitRange>								
							
			</field>									
			<field>									
				<name>OETA</name>								
				<description>Output Enable Turnaround time enable for RS-485 operation.</description>								
				<bitRange>[18:18]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>DEASSERTED</name>						
						<description>Deasserted. If selected by OESEL, the Output Enable signal deasserted at the end of the last stop bit of a transmission.</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>ASSERTED</name>						
						<description>Asserted. If selected by OESEL, the Output Enable signal remains asserted for 1 character time after then end the last stop bit of a transmission. OE will also remain asserted if another transmit begins before it is deasserted.</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>AUTOADDR</name>								
				<description>Automatic Address matching enable.</description>								
				<bitRange>[19:19]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>DISABLED</name>						
						<description>Disabled. When addressing is enabled by ADDRDET, address matching is done by software. This provides the possibility of versatile addressing (e.g. respond to more than one address).</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>ENABLED</name>						
						<description>Enabled. When addressing is enabled by ADDRDET, address matching is done by hardware, using the value in the ADDR register as the address to match.</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>OESEL</name>								
				<description>Output Enable Select.</description>								
				<bitRange>[20:20]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>FLOW_CONTROL</name>						
						<description>Flow control. The RTS signal is used as the standard flow control function.</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>OUTPUT_ENABLE</name>						
						<description>Output enable. The RTS signal is taken over in order to provide an output enable signal to control an RS-485 transceiver.</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>OEPOL</name>								
				<description>Output Enable Polarity.</description>								
				<bitRange>[21:21]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>LOW</name>						
						<description>Low. If selected by OESEL, the output enable is active low.</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>HIGH</name>						
						<description>High. If selected by OESEL, the output enable is active high.</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RXPOL</name>								
				<description>Receive data polarity.</description>								
				<bitRange>[22:22]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>NOT_CHANGED</name>						
						<description>Not changed. The RX signal is used as it arrives from the pin. This means that the RX rest value is 1, start bit is 0, data is not inverted, and the stop bit is 1.</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>INVERTED</name>						
						<description>Inverted. The RX signal is inverted before being used by the UART. This means that the RX rest value is 0, start bit is 1, data is inverted, and the stop bit is 0.</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>TXPOL</name>								
				<description>Transmit data polarity.</description>								
				<bitRange>[23:23]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>NOT_CHANGED</name>						
						<description>Not changed. The TX signal is sent out without change. This means that the TX rest value is 1, start bit is 0, data is not inverted, and the stop bit is 1.</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>INVERTED</name>						
						<description>Inverted. The TX signal is inverted by the UART before being sent out. This means that the TX rest value is 0, start bit is 1, data is inverted, and the stop bit is 0.</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved. Read value is undefined, only zero should be written.</description>								
				<bitRange>[31:24]</bitRange>								
							
