cmsis-svd/cmsis-svd/data/NXP/LPC11E6x.svd
		<register>
			<dim>3</dim>
			<dimIncrement>0x4</dimIncrement>
			<dimIndex>0-2</dimIndex>
			<name>SET[%s]</name>
			<displayName>SET[%s]</displayName>
			<description>Write: Set port  register Read: port output bits </description>
			<addressOffset>0x2200</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SETP00</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>SETP01</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>SETP02</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>SETP03</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>SETP04</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>SETP05</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>SETP06</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>SETP07</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>SETP08</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>SETP09</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>SETP010</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>SETP011</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>SETP012</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>SETP013</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>SETP014</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>SETP015</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>SETP016</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>SETP017</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>SETP018</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>SETP019</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>SETP020</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>SETP021</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>SETP022</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>SETP023</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>SETP024</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>SETP025</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>SETP026</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>SETP027</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>SETP028</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>SETP029</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>SETP030</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>SETP031</name>
					<description>Read or set output bits. 0 = Read: output bit: write: no operation. 1 = Read: output bit; write: set output bit.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>3</dim>
			<dimIncrement>0x4</dimIncrement>
			<dimIndex>0-2</dimIndex>
			<name>CLR[%s]</name>
			<displayName>CLR[%s]</displayName>
			<description>Clear port</description>
			<addressOffset>0x2280</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>CLRP00</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>CLRP01</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>CLRP02</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>CLRP03</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>CLRP04</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>CLRP05</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>CLRP06</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>CLRP07</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>CLRP08</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>CLRP09</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>CLRP010</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>CLRP011</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>CLRP012</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>CLRP013</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>CLRP014</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>CLRP015</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>CLRP016</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>CLRP017</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>CLRP018</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>CLRP019</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>CLRP020</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>CLRP021</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>CLRP022</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>CLRP023</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>CLRP024</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>CLRP025</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>CLRP026</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>CLRP027</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>CLRP028</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>CLRP029</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>CLRP030</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>CLRP031</name>
					<description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>3</dim>
			<dimIncrement>0x4</dimIncrement>
			<dimIndex>0-2</dimIndex>
			<name>NOT[%s]</name>
			<displayName>NOT[%s]</displayName>
			<description>Toggle port </description>
			<addressOffset>0x2300</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>NOTP00</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>NOTP01</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>NOTP02</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>NOTP03</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>NOTP04</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>NOTP05</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>NOTP06</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>NOTP07</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>NOTP08</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>NOTP09</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>NOTP010</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>NOTP011</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>NOTP012</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>NOTP013</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>NOTP014</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>NOTP015</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>NOTP016</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>NOTP017</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>NOTP018</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>NOTP019</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>NOTP020</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>NOTP021</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>NOTP022</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>NOTP023</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>NOTP024</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>NOTP025</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>NOTP026</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>NOTP027</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>NOTP028</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>NOTP029</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>NOTP030</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>NOTP031</name>
					<description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
