cmsis-svd/cmsis-svd/data/NXP/LPC11E6x.svd
				</field>
				<field>
					<name>PMAT</name>
					<description>This field displays the current state of pattern matches. A 1 in any bit of this field indicates that the corresponding product term is matched by the current state of the appropriate inputs.</description>
					<bitRange>[31:24]</bitRange>
					
				</field>
			</fields>
		</register>
		<register>
			<name>PMSRC</name>
			<description>Pattern match interrupt bit-slice source register</description>
			<addressOffset>0x02C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>Reserved</name>
					<description>Software should not write 1s to unused bits.</description>
					<bitRange>[7:0]</bitRange>
					
				</field>
				<field>
					<name>SRC0</name>
					<description>Selects the input source for bit slice 0</description>
					<bitRange>[10:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INPUT_0_SELECTS_PIN</name>
							<description>Input 0. Selects the output of pin interrupt select register 0 as the source to bit slice 0.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_1_SELECTS_PIN</name>
							<description>Input 1. Selects the output of pin interrupt select register 1 as the source to bit slice 0.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_2_SELECTS_PIN</name>
							<description>Input 2. Selects the output of pin interrupt select register 2 as the source to bit slice 0.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_3_SELECTS_PIN</name>
							<description>Input 3. Selects the output of pin interrupt select register 3 as the source to bit slice 0.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_4_SELECTS_PIN</name>
							<description>Input 4. Selects the output of pin interrupt select register 4 as the source to bit slice 0.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_5_SELECTS_PIN</name>
							<description>Input 5. Selects the output of pin interrupt select register 5 as the source to bit slice 0.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_6_SELECTS_PIN</name>
							<description>Input 6. Selects the output of pin interrupt select register 6 as the source to bit slice 0.</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_7_SELECTS_PIN</name>
							<description>Input 7. Selects the output of pin interrupt select register 7 as the source to bit slice 0.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SRC1</name>
					<description>Selects the input source for bit slice 1</description>
					<bitRange>[13:11]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INPUT_0_SELECTS_PIN</name>
							<description>Input 0. Selects pin interrupt input 0 as the source to bit slice 1.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_1_SELECTS_PIN</name>
							<description>Input 1. Selects pin interrupt input 1 as the source to bit slice 1.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_2_SELECTS_PIN</name>
							<description>Input 2. Selects pin interrupt input 2 as the source to bit slice 1.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_3_SELECTS_PIN</name>
							<description>Input 3. Selects pin interrupt input 3 as the source to bit slice 1.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_4_SELECTS_PIN</name>
							<description>Input 4. Selects pin interrupt input 4 as the source to bit slice 1.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_5_SELECTS_PIN</name>
							<description>Input 5. Selects pin interrupt input 5 as the source to bit slice 1.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_6_SELECTS_PIN</name>
							<description>Input 6. Selects pin interrupt input 6 as the source to bit slice 1.</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_7_SELECTS_PIN</name>
							<description>Input 7. Selects pin interrupt input 7 as the source to bit slice 1.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SRC2</name>
					<description>Selects the input source for bit slice 2</description>
					<bitRange>[16:14]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INPUT_0_SELECTS_PIN</name>
							<description>Input 0. Selects pin interrupt input 0 as the source to bit slice 2.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_1_SELECTS_PIN</name>
							<description>Input 1. Selects pin interrupt input 1 as the source to bit slice 2.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_2_SELECTS_PIN</name>
							<description>Input 2. Selects pin interrupt input 2 as the source to bit slice 2.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_3_SELECTS_PIN</name>
							<description>Input 3. Selects pin interrupt input 3 as the source to bit slice 2.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_4_SELECTS_PIN</name>
							<description>Input 4. Selects pin interrupt input 4 as the source to bit slice 2.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_5_SELECTS_PIN</name>
							<description>Input 5. Selects pin interrupt input 5 as the source to bit slice 2.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_6_SELECTS_PIN</name>
							<description>Input 6. Selects pin interrupt input 6 as the source to bit slice 2.</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_7_SELECTS_PIN</name>
							<description>Input 7. Selects pin interrupt input 7 as the source to bit slice 2.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SRC3</name>
					<description>Selects the input source for bit slice 3</description>
					<bitRange>[19:17]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INPUT_0_SELECTS_PIN</name>
							<description>Input 0. Selects pin interrupt input 0 as the source to bit slice 3.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_1_SELECTS_PIN</name>
							<description>Input 1. Selects pin interrupt input 1 as the source to bit slice 3.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_2_SELECTS_PIN</name>
							<description>Input 2. Selects pin interrupt input 2 as the source to bit slice 3.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_3_SELECTS_PIN</name>
							<description>Input 3. Selects pin interrupt input 3 as the source to bit slice 3.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_4_SELECTS_PIN</name>
							<description>Input 4. Selects pin interrupt input 4 as the source to bit slice 3.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_5_SELECTS_PIN</name>
							<description>Input 5. Selects pin interrupt input 5 as the source to bit slice 3.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_6_SELECTS_PIN</name>
							<description>Input 6. Selects pin interrupt input 6 as the source to bit slice 3.</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_7_SELECTS_PIN</name>
							<description>Input 7. Selects pin interrupt input 7 as the source to bit slice 3.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SRC4</name>
					<description>Selects the input source for bit slice 4</description>
					<bitRange>[22:20]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INPUT_0_SELECTS_PIN</name>
							<description>Input 0. Selects pin interrupt input 0 as the source to bit slice 4.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_1_SELECTS_PIN</name>
							<description>Input 1. Selects pin interrupt input 1 as the source to bit slice 4.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_2_SELECTS_PIN</name>
							<description>Input 2. Selects pin interrupt input 2 as the source to bit slice 4.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_3_SELECTS_PIN</name>
							<description>Input 3. Selects pin interrupt input 3 as the source to bit slice 4.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_4_SELECTS_PIN</name>
							<description>Input 4. Selects pin interrupt input 4 as the source to bit slice 4.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_5_SELECTS_PIN</name>
							<description>Input 5. Selects pin interrupt input 5 as the source to bit slice 4.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_6_SELECTS_PIN</name>
							<description>Input 6. Selects pin interrupt input 6 as the source to bit slice 4.</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_7_SELECTS_PIN</name>
							<description>Input 7. Selects pin interrupt input 7 as the source to bit slice 4.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SRC5</name>
					<description>Selects the input source for bit slice 5</description>
					<bitRange>[25:23]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INPUT_0_SELECTS_PIN</name>
							<description>Input 0. Selects pin interrupt input 0 as the source to bit slice 5.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_1_SELECTS_PIN</name>
							<description>Input 1. Selects pin interrupt input 1 as the source to bit slice 5.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_2_SELECTS_PIN</name>
							<description>Input 2. Selects pin interrupt input 2 as the source to bit slice 5.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_3_SELECTS_PIN</name>
							<description>Input 3. Selects pin interrupt input 3 as the source to bit slice 5.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_4_SELECTS_PIN</name>
							<description>Input 4. Selects pin interrupt input 4 as the source to bit slice 5.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_5_SELECTS_PIN</name>
							<description>Input 5. Selects pin interrupt input 5 as the source to bit slice 5.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_6_SELECTS_PIN</name>
							<description>Input 6. Selects pin interrupt input 6 as the source to bit slice 5.</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_7_SELECTS_PIN</name>
							<description>Input 7. Selects pin interrupt input 7 as the source to bit slice 5.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SRC6</name>
					<description>Selects the input source for bit slice 6</description>
					<bitRange>[28:26]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INPUT_0_SELECTS_PIN</name>
							<description>Input 0. Selects pin interrupt input 0 as the source to bit slice 6.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_1_SELECTS_PIN</name>
							<description>Input 1. Selects pin interrupt input 1 as the source to bit slice 6.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_2_SELECTS_PIN</name>
							<description>Input 2. Selects pin interrupt input 2 as the source to bit slice 6.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_3_SELECTS_PIN</name>
							<description>Input 3. Selects pin interrupt input 3 as the source to bit slice 6.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_4_SELECTS_PIN</name>
							<description>Input 4. Selects pin interrupt input 4 as the source to bit slice 6.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_5_SELECTS_PIN</name>
							<description>Input 5. Selects pin interrupt input 5 as the source to bit slice 6.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_6_SELECTS_PIN</name>
							<description>Input 6. Selects pin interrupt input 6 as the source to bit slice 6.</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_7_SELECTS_PIN</name>
							<description>Input 7. Selects pin interrupt input 7 as the source to bit slice 6.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SRC7</name>
					<description>Selects the input source for bit slice 7</description>
					<bitRange>[31:29]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INPUT_0_SELECTS_PIN</name>
							<description>Input 0. Selects pin interrupt input 0 as the source to bit slice 7.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_1_SELECTS_PIN</name>
							<description>Input 1. Selects pin interrupt input 1 as the source to bit slice 7.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_2_SELECTS_PIN</name>
							<description>Input 2. Selects pin interrupt input 2 as the source to bit slice 7.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_3_SELECTS_PIN</name>
							<description>Input 3. Selects pin interrupt input 3 as the source to bit slice 7.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_4_SELECTS_PIN</name>
							<description>Input 4. Selects pin interrupt input 4 as the source to bit slice 7.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_5_SELECTS_PIN</name>
							<description>Input 5. Selects pin interrupt input 5 as the source to bit slice 7.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_6_SELECTS_PIN</name>
							<description>Input 6. Selects pin interrupt input 6 as the source to bit slice 7.</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_7_SELECTS_PIN</name>
							<description>Input 7. Selects pin interrupt input 7 as the source to bit slice 7.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
			</fields>
		</register>
		<register>
			<name>PMCFG</name>
			<description>Pattern match interrupt bit slice configuration register</description>
			<addressOffset>0x030</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PROD_ENDPTS</name>
					<description>A 1 in any bit of this field causes the corresponding bit slice to be the final component of a product term in the boolean expression. This has two effects: 1. The interrupt request associated with this bit-slice will be asserted whenever a match to that product term is detected. 2. The next bit slice will start a new, independent product term in the boolean expression (i.e. an OR will be inserted in the boolean expression following the element controlled by this bit slice).</description>
					<bitRange>[6:0]</bitRange>
					
